industry_grouping = {
    "能源": [
        "煤炭",
        "石油石化"
    ],
    "公用事业": [
        "电力及公用事业"
    ],
    "原材料": [
        "钢铁",
        "建材",
        "有色金属",
        "农林牧渔"
    ],
    "工业": [
        "电力设备及新能源",
        "机械",
        "建筑",
        "国防军工",
        "汽车",
        "轻工制造"
    ],
    "消费": [
        "家电",
        "商贸零售",
        "纺织服装",
        "传媒",
        "消费服务",
        "房地产",
        "食品饮料"
    ],
    "医疗保健": [
        "医药"
    ],
    "金融": [
        "非银行金融",
        "综合金融"
    ],
    "信息技术": [
        "计算机",
        "电子"
    ],
    "通信服务": [
        "通信"
    ],
    "交通运输": [
        "交通运输"
    ]
}